# 1、有字符串如下：
print('----------------------------第一题------------------------------')
# names = '任亮@ 任我行@李思民@ 李想@王子@刘呼兰@苏东坡@王巴 丹@刘贝@贾  帅北@付心含'
# 1、字符串names中的姓名之间用@连接，有些学生中多打了空格，请你先把空格去掉

# a = names.replace(' ','')
# print(a)



print('-------------------------第二题---------------------------------')
# 2、把姓名生成字典，每个姓下对应哪些人，例子：{'张':['张三丰','张无忌'],'周':['周芷若']}

# d = {}   # 构建一个新字典用来生成结果
# b=a.split('@')  # 把字符串按照@符号分割
# for i in b:    # 循环赋值给i
#     if i[0] in d:   # 判断键是否在字典中
#         d[i[0]].append(i)  # 把姓增加进去
#     else:
#         d[i[0]] = [i]  # 取出i的第一个字（此处的i代表的是名字）
# print(d)



print('-----------------------------第三题-----------------------------')
k=[3,2,44,55,11]

# 3、循环打印列表中的元素
# b = 0
# while b <len(k):
#     print(k[b])
#     b+=1

# for i in k :
#     print(i)

print('--------------------------第四题--------------------------------')

# 4、循环打印列表中的偶数
# k=[3,2,44,55,11]
# for i in k:
#     if i%2==0:
#         print(i)
print('--------------------------第五题--------------------------------')
# 5、把列表转换为字符串，结果如右：3$2$44$55$11
# 方式一：
k=[3,2,44,55,11,113,173,12823]
s=''
# for i in k:
#     s=s+str(i)+"$"
# print(s[:-1])

# 方式二：用下标遍历
# for i in range(len(k)):  # 遍历字符串
#     if i !=len(k)-1:  # 如果i的值不等于k的最后一位
#         s=s+str(k[i])+'$'  # s的值等于k的值转化为字符串在拼接上$
#     else:
#         s = s + str(k[i])   # 如果i的值等于k的最后一位，s的值等于k的值转化为字符串
# print(s)

# 方式三：
# print('$'.join([str(i) for i in k]))
# # 等价于
# print('$'.join(str(i) for i in k))
print('--------------------------第六题--------------------------------')


# 6、打印列表中的质数（质数只能被1和它本身整除）
# k=[3,2,44,55,11,113,173,12823]
# for i in k:
#     for j in range(2,i):
#         if i%j==0:
#             break
#     else:
#         print(i)

print('--------------------------第七题--------------------------------')
# 7、打印10-100之间的质数
# for i in range(10,101):
#     for j in range(2,i):
#         if i%j==0:
#             break
#     else:
#         print(i)

print('--------------------------第八题--------------------------------')
# 有列表g=[22,33,11,22,11,11]

g=[22,33,11,22,11,11]

# 8、统计每个元素对应的下标集合，结果参考：{22:[0,3],33:[1],11:[2,4,5]}
result = {}  # 设置新字典，用来接收结果
for i in range(len(g)):  # 从列表中循环取数赋值给i
    if g[i] in result:  # g[i] 指的是列表中下标为0的元素，也就是22 判断22是否在result中 ，第一次运行，22 不在result中，跳转到else部分
        result[g[i]].append(i)    # 第4次运行时，下标为3，此时列表中已经有22对应的值了，就在后面直接插入此时的下标3
    else:
        result[g[i]]=[i]   # g[i]指的是列表中i对应的下标，第一次运行下标为0，也就是22。result中22这个键的值为此时的下标0
print(result)



# index =0   # 设置下标从0开始
# for num in g:    # 从列表g中循环取值赋值给变量num
#     if num in result:  # 如果num的值在新字典result中
#         result[num].append(index)    # 从result中取值并插入索引
#     else:
#         result[num]=[index]
#     index+=1
# print(result)
"""
等价于
"""
# for value in g:   # 从列表g中循环取值赋值给value
#     if value not in result:    # 如果value的值不在新字典中
#         result[value]=[]   # 设置新列表的值为空值
#     result[value].append(index)   # 把下标插入到当前的值中
#     index+=1  # 下标+1
# print(result)



print('--------------------------第九题--------------------------------')
# 9、统计每个元素出现的次数，结果参考：{22:2,33:1,11:3}
g=[22,33,11,22,11,11]
s = {}
# for num in g:  # 从列表g 里循环取值赋值给num
#     count_dict[num]=count_dict.get(num,0)+1  # 新列表中的值等于使用get 方法获取num从下标0开始，每次+1的值
# print(count_dict)
'''
等价于
'''
for i in g:  # 从列表g 里循环取值赋值给value
    s[i]=g.count(i)
print(s)

print('--------------------------第十题--------------------------------')
# 10、对列表进行去重
new_list=[]  # 定义一个新列表，用来存储去重后的结果
for value in g:   # 从列表g里循环取值赋值给value
    if value not in new_list:  # 如果新列表中没有value的值
        new_list.append(value)   # 追加到新列表中
print(new_list)
'''
直接转换成集合，达到去重目的
'''
s=set(g)  # 直接转换成集合
print(s)

print('--------------------------第十一题--------------------------------')
# 11、使用for循环，打印列表中的最小值
b = g[0]
for i in g:
    if i<b:
        b = i
print(i)