names = ["张喻","张小张","李丽","白莲","李飞燕","邝玉龙"]
# 1、打印列表中的姓名
# print(names)
# 2、打印列表中的姓
# for i in names:
#     print(i[0])
# 3、统计列表中有几个姓
# d=set()
# for i in names:
#     d.add(i[0])
# print(f'有{d}{len(d)}个姓')

# 4、把名字中只有两个字的打印出来
# for i in names:
#     if len(i)==2:
#         print(i)
# 5、统计姓李的有几个人
# l=[]
# for i in names:
#     if i[0]=='李':
#         l.append(i)
# print(len(l))
# 1、打印10以内的整数
# for i in range(11):
    # print(i)
# 2、打印10以内的奇数
# for i in range(11):
#     if i%2 !=0:
#         print(i)
# 3、打印10以内能被5整除的数
# for i in range(11):
#     if i%5 ==0:
#         print(i)
# 4、打印20以内既能被2整除，又能被3整除的数
# for i in range(21):
#     if i %2==0 and i%3==0:
#         print(i)
# 5、打印s="你好，小白"字符串的字符
s="你好，小白"
for i in s:
    print(i)


k=[3,2,44,2,11]
# 6、打印列表中的元素

# 7、循环打印列表中的偶数

#
# 8、打印列表中能被11整数的数

#
#
k=[3,2,44,2,11,68]
# 9、打印列表中的回文数字



# 10、统计列表中奇数的个数

# 11、打印下标对应的值，结果如右{0:3,1:2,2:44,3:2,4:11}


# 12、把列表转换为字符串，结果如右：3244211



# 14、把列表变成字符串，每两个字符之间用$连接，结果为：2$44$2$11

#15、计算列表中每个元素所在的下标集合，结果为：{3:[0],2:[1,3],44:[2],11:[4]}# k = {}

#
#
s1= "hello every one"
#
# 1、计算字符串的长度

# 2、打印字符串中的第一个字符

# 3、打印字符串中第3个字符

# 4、打印字符串中最后一个字符

# 5、把every取出来

# 6、对字符串进行翻转

# 7、对字符串中的e删除

# 8、把字符串中的o替换成g

# 9、计算字符串中e的个数

# 10、取出one

# 11、y在字符串中吗

# 12、把字符串转大写

# 13、取出yrev

# 有字符串
s2="上海自来水来自海上"
# 13、怎么实现打印"来来"

# 有列表
l1 = [1, 1, 2, 32, 1, 2, 3]
# 15、求列表元素的个数

# 16、求1的个数

#
# 17、判断l1个数是否为奇数，如果是就追加一个4进去，否则删除列表中的最后一个元素，最后打印这个列表


# 18、判断列表中的第3个数是偶数吗

# 19、5在列表中吗

# 20、在列表的第3位插入6

# 21、实现列表的去重

# 24、删除列表的第4位

# 25、求列表的最大值

# 有字典如下：
d1 = {
    "name": "heihei",
    "age": 21,
    "sex": "man",
    "address": "周",
    "hobbies": ["吃", "喝", "玩", "乐"]
}
# 26、打印字典中的元素个数


# 27、求爱好个数


# 28、打印名字

# 29、把性别修改成woman

# 30、年龄加1岁，请修改

# 31、把爱好中的吃删除

# 33、如果地址是周口，请把它修改成驻马店，否则给他追加一个爱好

# 34、打印1-100之间的整数

#
# 35、打印3-56之间能被3整除或能被4整除的数

# 36、计算1-100之间所有整数的平均数

# 37、统计10-50之间回文的个数,回文就是正反都一样，比如11呀 22呀

# 38、打印10-100之间哪些数字是以1开头的


# 39、打印30-100之间哪些数字是以2结尾的

# 40、统计30-100之间既是2的倍数又包含3的数的个数
#
# # 有列表
l1 = ['我', '在', '哪', '我', '是', '谁']
# 41、列表生成字符串，用for循环实现
# 最后的结果为：我@在@哪@我@是@谁

# 42、输出每个字的索引列表，用字典表示
# d = {'我':[0,3],'在':[1],'哪':[2],'是':[4],'谁':[5]}
